org/holymacs/org_mode.org
#+TITLE: Holymacs ~ Org mode module
#+AUTHOR: MinasMazar
#+EMAIL: minasmazar@gmail.com
#+DATE: <2024-04-20 Sat>
#+PROPERTY: header-args :tangle ~/.emacs.d/modules/org-mode.el :mkdirp yes
#+SETUPFILE: ../../templates/_header.org
#+HTML_LINK_UP: ../holymacs.html

* org-mode configuration

Add a capture template to store notes in =inbox=

#+begin_src elisp
  (use-package org
    :config
    (require 'org-capture)
    (add-to-list 'org-capture-templates
  		 '("i" "Inbox" entry (file+headline "~/Dropbox/org/inbox.org" "Inbox")
  		    "* TODO %?\n %i\n  %a"))
    :custom
    (org-todo-keywords . '((sequence "TODO(t)" "IN PROGRESS(p)" "|" "DONE(d!)")))
    :bind
    (:map org-mode-map
  	  ("M-p" . #'org-move-subtree-up)
  	  ("M-n" . #'org-move-subtree-down)))
#+end_src

Preview the HTML exported buffer you see when exporting an org file in a preview using some built-in Emacs function.

#+begin_src elisp
  (advice-add #'org-html-export-as-html :filter-return #'browse-url-of-buffer)
#+end_src

* Org and Second Brain ([[https://www.orgroam.com/][Org-roam]])

#+begin_src elisp
(use-package org-roam
  :bind
  (("M-o r f" . #'org-roam-node-find)))
#+end_src

