holymacs/org_mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Holymacs ~ Org mode module</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../holymacs.html"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Holymacs ~ Org mode module</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org50e1722">org-mode configuration</a></li>
<li><a href="#orgdacd9b8">Org and Second Brain (Org-roam)</a></li>
</ul>
</div>
</div>
<div id="outline-container-org50e1722" class="outline-2">
<h2 id="org50e1722">org-mode configuration</h2>
<div class="outline-text-2" id="text-org50e1722">
<p>
Add a capture template to store notes in <code>inbox</code>
</p>

<div class="org-src-container">
<pre class="src src-elisp">(use-package org
  :config
  (require 'org-capture)
  (add-to-list 'org-capture-templates
                 '("i" "Inbox" entry (file+headline "~/Dropbox/org/inbox.org" "Inbox")
                    "* TODO %?\n %i\n  %a"))
  :custom
  (org-todo-keywords . '((sequence "TODO(t)" "IN PROGRESS(p)" "|" "DONE(d!)")))
  :bind
  (:map org-mode-map
          ("M-p" . #'org-move-subtree-up)
          ("M-n" . #'org-move-subtree-down)))
</pre>
</div>

<p>
Preview the HTML exported buffer you see when exporting an org file in a preview using some built-in Emacs function.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(advice-add #'org-html-export-as-html :filter-return #'browse-url-of-buffer)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdacd9b8" class="outline-2">
<h2 id="orgdacd9b8">Org and Second Brain (<a href="https://www.orgroam.com/">Org-roam</a>)</h2>
<div class="outline-text-2" id="text-orgdacd9b8">
<div class="org-src-container">
<pre class="src src-elisp">(use-package org-roam
  :bind
  (("M-o r f" . #'org-roam-node-find)))
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-04-20 Sat 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
